Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh44-45-v3.tmx
Source language: bo
Languages: en

source: སྨོན་ལམ་གནས་ན་བཞུགས་ཤིང་ཐུགས་རྗེ་བྱམས་སྤྱན་གྱིས། །གང་རྣམས་སེམས་ཅན་གནས་སུ་རྣམ་པར་གཟིགས་མཛད་ཅིང་། །སྲིད་པའི་རྒྱ་མཚོ་གནས་པའི་འགྲོ་མང་མངོན་འདོན་པ། །མཁའ་ལྡིང་གཞོན་འདྲ་དེ་དག་གནས་ནི་འདི་འདྲའོ། །
en: {15} “This is the dwelling of those who are like garuḍa princes, Who dwell on the ground of prayer and have the sight of love and compassion, Who look upon the dwelling places of all beings And liberate multitudes from their locations in the ocean of existences.

source: གང་རྣམས་ཆོས་དབྱིངས་མཁའ་ལ་ཉི་ཟླ་འདྲ་ཚུལ་དུ། །སེམས་ཅན་གནས་སུ་འོད་ཀྱིས་ཁྱབ་པར་རྣམ་སྤྱོད་པ། །སྨོན་ལམ་དཀྱིལ་འཁོར་ཡེ་ཤེས་དྲི་མེད་བཟང་པོའི་འོད། །འཇིག་རྟེན་སྣང་བར་མཛད་པ་དེ་དག་གནས་འདི་ཡིན། །
en: {16} “This is the dwelling of those who are like illuminators of the world, Who, like suns and moons in the sky of the realm of phenomena, Have a conduct that spreads light throughout the habitations of beings, The excellent, stainless light of wisdom from the disks of prayer.

source: གང་རྣམས་སེམས་ཅན་གཅིག་ནི་ཡོངས་སུ་སྨིན་བྱའི་ཕྱིར། །ཕྱི་མཐའི་བསྐལ་པ་བྱེ་བ་ཟད་དུ་བརྟན་གནས་ལ། །སེམས་ཅན་གཅིག་ལ་ཇི་བཞིན་དེ་བཞིན་འགྲོ་བ་ཀུན། །འཇིག་རྟེན་མགོན་དུ་གྱུར་པ་དེ་དག་གནས་འདི་ཡིན། །
en: {17} “This is the dwelling of those who are protectors of the world, Who in order to ripen one single being will resolutely Remain throughout millions of future kalpas And do the same for all beings as with that one being.

source: གང་རྣམས་འབྱམ་ཀླས་ཞིང་གཅིག་ཕྱི་མཐའི་བསྐལ་བར་ཡང་། །འགྲོ་དོན་བརྩོན་འགྲུས་སྐྱོ་མེད་སྤྱོད་པ་རྣམ་སྤྱོད་པ། །ཞིང་གཅིག་ཇི་བཞིན་དེ་བཞིན་ཕྱོགས་རྣམས་ཀུན་ཏུ་སྟེ། །བསམ་པ་རྡོ་རྗེ་བཞིན་བརྟན་དེ་དག་གནས་འདི་ཡིན། །
en: {18} “This is the dwelling of those whose motivation is as firm as a vajra, Who will unwearyingly act with diligence to benefit beings Throughout future kalpas in the entire extent of a realm And will do so in all directions as they do for one realm.

source: གང་རྣམས་ཕྱོགས་བཅུའི་བདེ་གཤེགས་རྣམས་ཀྱི་ཆོས་སྤྲིན་ལ། །སྟན་གཅིག་གནས་བཞིན་རྨོངས་པ་མེད་པར་འཐུང་བྱེད་ཀྱང་། །ཕྱི་མཐའི་བསྐལ་པ་ཁྲག་ཁྲིག་འགྲངས་པར་མི་ངོམས་སེམས། །བློ་ཆེན་རྒྱ་མཚོ་ལྟ་བུའི་གནས་ནི་འདི་འདྲའོ། །གང་རྣམས་ཞིང་མང་རྒྱ་མཚོ་བརྗོད་དུ་མེད་འདོང་ཞིང་། །
en: {19} “This is the dwelling of those with great understanding like an ocean, Who without any bewilderment drink on one seat From the Dharma clouds of the sugatas in the ten directions And will never have enough even in a hundred thousand million kalpas.

source: མགོན་པོའི་འཁོར་རྣམས་རྒྱ་མཚོར་ཡོངས་སུ་འཇུག་བྱེད་ལ། །རྒྱལ་བའི་མཆོད་པ་སྣ་ཚོགས་རྒྱ་མཚོ་རབ་བྱེད་པ། །ཆགས་མེད་སྤྱོད་ཡུལ་མངའ་བ་དེ་དག་གནས་འདི་ཡིན། །
en: {20} “This is the dwelling of those who have an unimpeded field of activity, Who go to countless oceans of multitudes of realms And enter oceans of the assemblies of the lords And make oceans of various offerings to the jinas.

source: བརྟན་པ་གྲངས་རྣམས་སྨོན་ལམ་རྒྱ་མཚོར་འཇུག་བྱེད་ཅིང་། །སྤྱོད་པ་རྒྱ་མཚོར་མཐའ་དང་དབུས་མེད་ཞུགས་གྱུར་ཏེ། །འགྲོ་ལ་ཕན་ཕྱིར་བསྐལ་པ་རྒྱ་མཚོ་མང་སྤྱོད་པ། །ཡོན་ཏན་འབྱུང་གནས་དེ་དག་གནས་ནི་འདི་འདྲ་འོ། །
en: {21} “This is the dwelling of those who are the source of all good qualities, Who enter into an ocean, without end or middle, of conduct, Resolutely immersing themselves in an ocean of prayers And performing conduct that will benefit beings for an ocean of kalpas.

source: གང་རྣམས་སྐྲ་རྩེ་གཅིག་ཏུ་ཞིང་རྣམས་ཐམས་ཅད་དང་། །སངས་རྒྱས་ཐམས་ཅད་བསྐལ་པ་མཐའ་དང་དབུས་མེད་པ། །འཛུད་ཅིང་དེ་ཡི་ཚུལ་ལ་འཇུག་ཀྱང་རྨོངས་མྱེད་པ། །ཆགས་པ་མེད་པའི་མིག་ཅན་རྣམས་ཀྱི་གནས་འདི་ཡིན། །
en: {22} “This is the dwelling of those whose vision has no impediment, Who enter, without becoming confused, All realms in the tip of a single hair, Together with all buddhas for kalpas without middle or end.

source: གང་རྣམས་སེམས་ཀྱི་སྐད་ཅིག་གཅིག་ལ་རྒྱ་མཚོ་ཡི། །བསྐལ་བ་འཛུད་བྱེད་ཞིང་དང་སངས་རྒྱས་འགྲོ་བ་རྣམས། །དེ་བཞིན་འཛུད་བྱེད་བསྒྲིབས་མེད་ཡེ་ཤེས་དྲན་གནས་པ། །ཡོན་ཏན་མཐར་ཕྱིན་དེ་དག་གནས་ནི་འདི་འདྲའོ། །
en: {23} “This is the dwelling of those who have completely attained good qualities, Who in a single instant of mind enter an ocean of kalpas And similarly are with buddhas and beings And established in unobscured wisdom and memory.

source: གང་རྣམས་ཞིང་མང་ཐམས་ཅད་རྡུལ་དུ་བགྲང་བྱས་ཤིང་། །ཆུ་བོ་མ་ལུས་ཐམས་ཅད་ཐིགས་པས་ཚད་བཟུང་སྟེ། །དེ་སྙེད་གྲངས་སུ་སྨོན་ལམ་མངོན་པར་སྒྲུབ་བྱེད་པ། །ཆགས་མེད་བགྲང་བ་དེ་དག་གནས་ནི་འདི་འདྲའོ། །
en: {24} “This is the dwelling of those who are unimpeded in enumeration, Who can count the number of atoms in all realms, Who know the number of drops in all rivers, And who have accomplished that number of prayers.

source: སྨོན་ལམ་གཟུངས་དང་ཏིང་འཛིན་སྒོ་ལ་འཇུག་བྱ་བ། །བསམ་གཏན་རྣམ་ཐར་སྨོན་ལམ་སྒོ་རྣམས་དེ་བཞིན་ཏེ། །བསྐལ་པ་མཐའ་ཡས་མངོན་པར་སྒྲུབ་ཅིང་རྣམ་སྤྱོད་པ། །བདེ་གཤེགས་སྲས་པོ་དགོངས་ལྡན་དེ་དག་འདིར་འདོང་ངོ་། །
en: {25} “This is where enter the sons of the sugatas, endowed with memory, Who enter the gateways of prayers, retentions, and samādhis And who in endless kalpas practice and accomplish The gateways to dhyānas, liberations, and prayers.

source: འདི་ན་གནས་པ་རྒྱལ་སྲས་རྣམ་པ་སྣ་ཚོགས་ཏེ། །ཚིག་དང་དོན་ལྡན་གཙུག་ལག་མང་པོ་མངོན་པར་སྒྲུབ། །འགྲོ་ལ་བདེར་འགྱུར་བཟོ་ཡི་གནས་སུ་བྱ་བ་དག །རྗེས་སུ་སེམས་ཤིང་དམ་པའི་གནས་ན་རྣམ་པར་སྤྱོད། །
en: {26} “This is where dwell the various sons of the jinas, Accomplishing many treatises with their words and meanings, Who accomplish the arts in order to bring happiness to beings— Contemplating this they dwell in this sublime place.

source: འདི་ན་གནས་པ་མངོན་ཤེས་ཐབས་དང་ཡེ་ཤེས་ཀྱིས། །ཕྱོགས་བཅུའི་སེམས་ཅན་འགྲོ་རྒྱུད་སྣ་ཚོགས་ཇི་སྙེད་པ། །ཀུན་ཏུ་སྐྱེ་ཞིང་འཆི་བའི་ཁྱད་པར་རྣམ་པར་སྟོན། །རྣམ་ཐར་སྒྱུ་མའི་ཚུལ་གནས་ཆགས་མེད་སྤྱོད་དང་ལྡན། །
en: {27} “Dwelling here, with higher cognition, method, and wisdom, They reveal all the births and the deaths everywhere Among all the existences of beings in the ten directions With unimpeded conduct within the liberation of the way of illusions.

source: འདི་ན་གནས་པ་ཐོག་མར་སེམས་བསྐྱེད་ཉེར་བཟུང་ཞིང་། །ཆོས་བཟང་མཐར་ཐུག་ཆོས་ཀྱི་སྤྱོད་པ་ཡོངས་སུ་སྟོན། །
en: {28} “Dwelling here, they manifest all their Dharma activity From the first development of motivation to the conclusion of the good Dharma.

source: སྤྲུལ་པའི་སྤྲིན་གྱིས་ཆོས་དབྱིངས་ཡོངས་སུ་རྒྱས་བཀང་ཞིང་། །དེ་བཞིན་རྣམ་འཕྲུལ་བརྒྱ་མང་ཀུན་ཀྱང་ཉེ་བར་སྟོན། །
en: They pervade the entire dharmadhātu with clouds of emanations And in the same way manifest many hundreds of miracles.

source: གང་རྣམས་སེམས་ཀྱི་ཆ་གཅིག་བྱང་ཆུབ་རྣམ་སངས་རྒྱས། །ཡེ་ཤེས་བློ་གྲོས་མཐའ་དང་དབུས་མེད་ལས་འཇུག་པ། །ཐོས་ཏེ་རྣམ་པར་བསམས་ན་འཇིག་རྟེན་རྨོངས་སུ་རུང་། །ཐུབ་པར་དཀའ་བ་དེ་དག་གནས་ནི་འདི་འདྲའོ། །
en: {29} “This is the dwelling of those who have attained what is difficult, Who with one aspect of the mind can enter realization, Enlightenment, wisdom, understanding, and activity without middle or end, Which would bewilder the world to hear and think of.

source: འདི་ནི་ཆགས་མེད་བློ་གྲོས་རྣམས། །ཆོས་དབྱིངས་བསྒྲིབས་པ་མེད་པའི་རྣམ་པར་སྤྱོད་བྱེད་པ། །དམྱིགས་པ་མེད་པའི་སྤྱོད་ཡུལ་ཅན། །དྲི་མེད་བསམ་པའི་བློ་གྲོས་གནས་ཡིན་ནོ།
en: {30} “This is the dwelling of those with unimpeded understanding, Who are active throughout the unobscured realm of phenomena, Whose field of activity is not dependent on objects of perception, And who have the aspiration of stainless understanding.

source: གང་རྣམས་ཆགས་པ་མེད་སྤྱོད་ཅིང་། །ཞིང་རྣམས་ཀུན་ཏུ་གནས་པ་མེད་པར་རྣམ་སྤྱོད་པ། །མི་གཉིས་ཤེས་ལ་སྤྱོད་པ་ཡི། །མཉམ་པ་མེད་པ་དེ་དག་གནས་འདི་ཡིན། །
en: {31} “This is the dwelling of those unequaled ones Whose activity is without impediment, Without a location, dwelling in all realms, And dwelling within nondual wisdom.

source: གང་རྣམས་ནམ་མཁའི་རང་བཞིན་དང་། །མཉམ་པའི་ཆོས་རྣམས་གནས་མེད་ཞི་བ་རྟོགས་གྱུར་ཏེ། །གང་རྣམས་མཁའ་ཡུལ་རྣམ་སྤྱོད་པ། །རྡུལ་དང་བྲལ་བ་དེ་དག་གནས་འདི་ཡིན། །
en: {32} “This is the dwelling of those free of dust, Who have realized the peace of the nature of phenomena Being the same as that of space, without location, And who have space as their field of activity.

source: འདི་ན་སྙིང་རྗེའི་སེམས་ལྡན་པ། །གནས་ཤིང་འགྲོ་བ་སྡུག་བསྔལ་གཟིར་བ་མཐོང་གྱུར་ནས། །འཇིག་རྟེན་ཕན་པར་བསམ་བརྩོན་ཏེ། །སྙིང་རྗེ་ཆེན་པོ་བརྙེས་པ་རྣམ་པར་སྤྱོད། །
en: {33} “This is where dwell those with minds of compassion, Who, seeing beings tormented by suffering, Are dedicated to aspiring to benefit the world And whose conduct has acquired great compassion.

source: འདི་ནས་མི་སྣང་མེད་གསལ་བར། །སེམས་ཅན་ཀུན་གྱི་གནས་སུ་ཐོགས་པ་མེད་པར་སྣང་། །ཉི་མ་ཟླ་བའི་དཀྱིལ་འཁོར་བཞིན། །འཁོར་བའི་ཞགས་པ་ཀུན་ལས་རྣམ་པར་གྲོལ། །
en: {34} “From here they clearly illuminate without impediment, As do the disks of the sun and the moon, All the abodes of beings, so that nothing remains unilluminated, And they free the beings from all the nooses of the māras.

source: རྒྱལ་སྲས་དེ་དག་འདི་ན་གནས། །རྒྱལ་བ་རྣམས་ཀྱི་ཞབས་དྲུང་ཐམས་ཅད་ཀུན་ན་ཡང་། །
en: {35} “Those sons of the jinas, while dwelling here, Are also at the feet of all the jinas.

source: ཞིང་རྣམས་ཀུན་ཏུ་རབ་ཏུ་སྣང་། །མཐའ་ཡས་བསྐལ་པ་རྣམས་ཀྱང་ཟད་པར་མཛད། །
en: They appear in all the realms Throughout all endless kalpas.

source: འདི་ནས་འགྲོ་བའི་ལུས་མཉམ་དང་། །རྒྱལ་སྲས་ཀུན་གྱི་ལུས་དང་གྲངས་མང་མཉམ་པ་ཡི། །སྤྲུལ་པའི་སྤྲིན་གྱིས་ཕྱོགས་ཀྱི་རྣམས། །མ་ལུས་ཐམས་ཅད་རྒྱས་པར་འགེངས་པ་མཛད། །
en: {36} “From here all the jinas pervade All directions without exception With clouds of emanated bodies As numerous as those of the bodies of beings.

source: འདི་ན་བཞུགས་པའི་དཔའ་བོ་རྣམས། །རྒྱལ་བའི་སྤྱོད་ཡུལ་ཐམས་ཅད་ཡོངས་སུ་འཇལ་བྱེད་ཅིང་། །
en: {37} “Those heroes, while dwelling here, Evaluate the fields of activity of all jinas.

source: བསྐལ་པ་བྱེ་བར་རྣམ་སྤྱོད་ཀྱང་། །ཡོངས་སུ་ངོམས་པར་འགྱུར་བའི་དུས་མེད་དོ། །
en: Though they have this conduct for millions of kalpas, There will never be a time when they have had enough.

source: འདིར་ནི་ཏིང་འཛིན་བྱེ་བ་རྣམས། །བརྗོད་དུ་མེད་པ་སྐད་ཅིག་རེ་རེ་རྟོགས་བྱས་ཤིང་། །
en: {38} “They realize here countless millions Of samādhis in each instant.

source: ཏིང་ངེ་འཛིན་གྱི་ཚུལ་བཞིན་དུ། །སངས་རྒྱས་ཡུལ་རྣམས་རྣམ་པར་སྟོན་པ་མཛད། །
en: Through entering samādhis in that way, They reveal the scope of perception of the buddhas.

source: འདིར་ནི་སྐད་ཅིག་བརྗོད་མེད་པའི། །བསྐལ་བ་ཞིང་རྣམས་སངས་རྒྱས་མཚན་ལ་རབ་བཞུགས་ཏེ། །ཤིན་ཏུ་ཡངས་པའི་བློ་ལྡན་པ། །བསྐལ་པ་དཔག་ཏུ་མེད་པའི་མཐར་ཡང་འབྱིན། །
en: {39} “Those with vast realization here In each instant enter into countless kalpas, Realms, and the names of buddhas Throughout the entirety of innumerable kalpas.

source: འདི་ན་གནས་ཤིང་ཚད་མེད་པའི། །བསྐལ་པར་སེམས་རྒྱུད་གཅིག་གིས་རབ་ཏུ་འཇུག་པ་བྱེད། །ཡོངས་རྟོག་འདུ་ཤེས་མེད་བྲལ་ཡང་། །འགྲོ་བའི་འདུ་ཤེས་དབང་དུ་སྟོན་པ་བྱེད། །
en: {40} “Those who are present here In one instant of mind enter countless kalpas, Manifesting according to the conceptions of beings While being free of thoughts and conceptions.

source: དེ་དག་ཏིང་འཛིན་འདི་གནས་སུ། །ཞུགས་ཀྱང་དུས་གསུམ་ཐམས་ཅད་གསལ་བར་མངོན་དུ་མཐོང་། །
en: {41} “They remain here within samādhi But see clearly all the three times.

source: སྐད་ཅིག་ཡུད་ལ་གནས་བརྟེན་ཅིང་། །རྣམ་ཐར་གནས་ལ་རྣམ་པར་སྤྱོད་པ་མཛད། །
en: They dwell within the length of each instant, Performing conduct within the dwelling of liberation.

source: དེ་དག་རྣམ་སྤྱོད་གནས་འདི་ན། །མ་གཡོས་ལུས་ཀྱིས་སྐྱིལ་མོ་ཀྲུང་དུ་འཁོད་བཞིན་དུ། །ཞིང་རྣམས་ཐམས་ཅད་ཀུན་ཏུ་ཡང་། །ཐམས་ཅད་ཁྱབ་པར་ཅིག་ཅར་ཡོངས་སུ་སྣང་། །
en: {42} “They who are present here in this dwelling Have bodies steadfastly seated cross-legged But manifest simultaneously pervading Everywhere throughout all realms.

source: ཁྱུ་མཆོག་དེ་དག་འདི་ན་གནས། །བདེ་གཤེགས་རྣམས་ལས་ཆོས་ཀྱི་རྒྱ་མཚོ་ཡང་དག་འཐུང་། །ཡེ་ཤེས་རྒྱ་མཚོར་རབ་ཏུ་ཞུགས། །
en: {43} “Those supreme leaders who dwell here Drink from the ocean of the Dharma of the sugatas, Enter into the ocean of wisdom, And attain the perfection of inexhaustible qualities.

source: མི་ཟད་ཡོན་ཏན་རྣམས་ཀྱི་ཕ་རོལ་ཕྱིན། །འདི་ན་ཞིང་རྣམས་ཀུན་གྲངས་དང་། །བསྐལ་པའི་གྲངས་དང་དེ་བཞིན་ཆོས་ཀྱི་གྲངས་རྣམས་དང་། །རྒྱལ་བ་ཀུན་གྱི་མཚན་གྱི་གྲངས། །སྒྲིབ་མེད་སེམས་དཔའ་རྣམ་པར་དགོངས་པ་མཛད། །
en: {44} “The bodhisattvas here are contemplating, Without obscuration, the number of all realms, The number of kalpas, and the number of Dharmas, And they attain the perfection of inexhaustible qualities.

source: རྒྱལ་སྲས་དེ་དག་འདི་ན་གནས། །དུས་གསུམ་ཞིང་མང་འགྲངས་པ་ཐམས་ཅད་མ་ལུས་པར། །དེ་དག་སྐད་ཅིག་གཅིག་གིས་ཀྱང་། །ཡོངས་སུ་འབྱུང་དང་འཇིག་པ་རྣམ་པར་འབྱེད། །
en: {45} “The jinaputras who are dwelling here Analyze within every single instant The creation and the destruction Of all the realms in the three times.

source: རྒྱལ་སྲས་དེ་དག་འདི་ན་གནས། །རྒྱལ་བའི་སྤྱོད་པ་སྨོན་ལམ་འགྲོ་བའི་དབང་པོ་རྣམས། །གནས་ན་རྣམ་པར་སྤྱོད་བྱེད་ཀྱང་། །རྒྱལ་སྲས་བློ་ལ་ཐོགས་པ་མེད་པས་མཐོང་། །
en: {46} “The jinaputras who are dwelling here, Practicing conduct in this location, See with the unobstructed realization of jinaputras The conduct and prayers of the jinas and the faculties of beings.

source: རྡུལ་ཕྲན་གཅིག་ལ་གང་ཡོད་པའི། །འཁོར་རྣམས་རྒྱ་མཚོ་ཞིང་མང་སེམས་ཅན་དེ་བཞིན་དུ། །བསྐལ་པ་རྡུལ་ཕྲན་ཀུན་མཉམ་པ། །སྒྲིབ་པ་མེད་པར་མཐོང་བ་རྣམས་ཀྱིས་མཐོང་། །
en: {47} “They see without obscuration, In every single atom, as many Oceans of assemblies, realms, and beings And kalpas as there are atoms.

source: རྡུལ་ཕྲན་ཀུན་རྩེར་དེ་བཞིན་དུ། །འཁོར་དང་ཞིང་དང་བསྐལ་པ་ཐམས་ཅད་མ་ལུས་པར། །ཀུན་ཀྱང་གཟུགས་བརྙན་ཐབས་ཚུལ་དུ། །ཤིན་ཏུ་རྣམ་ཕྱེ་ཡོངས་སུ་མཐོང་བ་ཡིན། །འདི་ནས་དེ་དག་ཆོས་རྣམས་ཀྱི། །
en: {48} “Thus, within all atoms They observe distinctly Every assembly, realm, and kalpa All as being like reflections.

source: རང་བཞིན་ཞིང་རྣམས་ཀུན་དང་དུས་དང་བསྐལ་པ་དང་། །ཡང་དག་སངས་རྒྱས་དེ་བཞིན་ཏེ། །རང་བཞིན་དངོས་བྲལ་འབྱུང་བའི་ཚུལ་གྱིས་མཁྱེན། །
en: {49} “From here they know the nature of phenomena, And similarly of all realms, times, Kalpas, and complete buddhas, to arise Without substance or a nature of their own.

source: འདི་གནས་སེམས་ཅན་མཉམ་ཉིད་དང་། །ཆོས་རྣམས་མཉམ་པ་ཉིད་དང་སངས་རྒྱས་མཉམ་ཉིད་དང་། །ཞིང་དང་སྨོན་ལམ་མཉམ་པ་ཉིད། །དུས་གསུམ་མཉམ་པ་ཉིད་ལའང་དེ་བཞིན་འཇུག །
en: {50} “Dwelling here, they see the equality of beings, The equality of the Dharma, and the equality of the buddhas, And they comprehend the equality of realms and of prayers And also the equality of the three times.

source: སེམས་ཅན་ཁྲག་ཁྲིག་རྣམ་པར་འདུལ། །
en: {51} “While constantly remaining in this dwelling, Some guide hundreds of billions of beings.

source: སངས་རྒྱས་ཁྲག་ཁྲིག་རྣམས་ཀྱང་དེ་བཞིན་གཞན་མཆོད་བྱེད། །གཞན་རྣམས་ཆོས་ལ་རྣམ་པར་རྟོག །
en: Others similarly offer to hundreds of billions of buddhas, And others are contemplating the Dharma.

source: འོན་ཀྱང་བརྟན་པ་གནས་མཆོག་འདི་ན་འཁོད། །བསྐལ་པ་ཁྲག་ཁྲིག་མང་པོས་ཀྱང་། །དེ་དག་སྨོན་ལམ་ཡེ་ཤེས་ཡུལ་བློའི་རྣམ་པ་དག །བདག་གིས་བརྗོད་པར་མི་ནུས་ཏེ། །
en: {52} “I do not have the ability to describe the aspects Of the scope of prayer and wisdom of their minds.

source: མཐའ་ཡས་བློ་མངའ་རྣམས་ཀྱི་ཤིན་ཏུ་ཡངས། །
en: Throughout hundreds of billions of kalpas, They possess a vast, infinite understanding.

source: དེ་དག་སྨད་པ་མི་མངའ་བ། །བསྒྲིབས་མེད་སྤྱོད་ཡུལ་རབ་ལ་ཤིན་ཏུ་དགྱེས་པ་ཡི། །ཕོ་བྲང་འདི་ལ་ཐལ་སྦྱར་ཏེ། །བདག་ཀྱང་ལུས་བཏུད་གུས་པར་ཕྱག་འཚལ་ལོ། །
en: {53} “I place my hands together and bow my body down In reverential homage to this palace Of those who have no inferiority, are unobscured, And delight in the supreme field of activity.

source: རྒྱལ་བའི་སྲས་ཀྱི་ཐུ་བོ་སྟེ། །བསྒྲིབས་མེད་སྤྱོད་པ་མངའ་བ་འཕགས་པ་བྱམས་པ་དེ། །རྣམ་དག་བློ་མངའ་དཔེ་མེད་ལ། །དེ་ཡི་རྗེས་སུ་བསམས་ཏེ་ཕྱག་འཚལ་ལོ། །དེ་ནས་ཚོང་དཔོན་གྱི་བུ་ནོར་བཟངས་ཀྱིས་ཁང་པ་བརྩེགས་པ་ཆེན་པོ་རྣམ་པར་སྣང་མཛད་ཀྱི་རྒྱན་ཀྱིས་བརྒྱན་པའི་སྙིང་པོ་ན་འཁོད་པའི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ལ།
en: {54} “I pay homage while contemplating That senior son of the Jina, Ārya Maitreya, who has unobscured conduct And a pure realization that is without compare.”

source: དེ་དག་དང་བྱང་ཆུབ་སེམས་དཔའི་བསྟོད་པ་གཞན་ཚད་མེད་པ་དག་གིས་ཀྱང་། མངོན་པར་བསྟོད་དེ་ཤིན་ཏུ་བཏུད་ནས་ཕྱག་འཚལ་ཏེ། རབ་ཏུ་གུས་པར་བལྟས་ནས་རིམ་གྲོར་བྱས་ཏེ། མངོན་དུ་བྱས་ནས་མཆོད་དེ་ཁང་པ་བརྩེགས་པ་ཆེན་པོ་རྣམ་པར་སྣང་མཛད་ཀྱི་རྒྱན་གྱིས་བརྒྱན་པའི་སྙིང་པོའི་སྒོ་ན། བྱང་ཆུབ་སེམས་དཔའི་སེམས་དཔའ་ཆེན་པོ་བྱམས་པ་ལ་བལྟ་བར་ནི་མོས། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བྱམས་པ་དང་ཕྲད་པར་ནི་དགའ་ཞིང་སྡོད་སྡོད་པ་ལས་དེས་བྱང་ཆུབ་སེམས་དཔའ་བྱམས་པ་ཁང་པ་བརྩེགས་པ།
en: {55} Then Sudhana, the head merchant’s son, having praised through these and countless other praises to the bodhisattvas who dwelled in the great kūṭāgāra called Vairocana­vyūhālaṃkāra­garbha, bowed down to them, prostrated to them, gazed reverently upon them, honored them, faced them, and made offerings to them, and he waited at the door of the great kūṭāgāra called Vairocana­vyūhālaṃkāra­garbha, hoping to see the bodhisattva mahāsattva Maitreya and delighting to meet the bodhisattva mahāsattva Maitreya.

source: དེའི་ཕྱི་རོལ་གྱི་ཕྱོགས་གཞན་ཞིག་ནས་སྲོག་ཆགས་བརྒྱ་སྟོང་དུ་མའི་འཁོར་དང་། ལྷ་དང་ཀླུ་དང་། གནོད་སྦྱིན་དང་། དྲི་ཟ་དང་། ལྷ་མ་ཡིན་དང་།
en: Then he saw the bodhisattva Maitreya coming from somewhere else outside the kūṭāgāra, with a retinue of many hundreds of thousands of beings and preceded by many lords of devas, nāgas, yakṣas, gandharvas, asuras, garuḍas, kinnaras, and mahoragas.

source: ནམ་མཁའ་ལྡིང་དང་། མིའམ་ཅི་དང་། ལྟོ་འཕྱེ་ཆེན་པོའི་དབང་པོ་དུ་མས་མདུན་དུ་བྱས་ཏེ། གཡས་གཡོན་ནས་བརྒྱ་བྱིན་དང་།
en: On his right was Śakra and on his left Brahmā.

source: ཚངས་པ་དང་། འཇིག་རྟེན་གྱི་མགོན་པོ་རྣམས་ཀྱིས་ཕྱག་བྱ་ཞིང་ཡུལ་དེ་ན་གནས་པ་གཉེན་བཤེས་སུ་འོང་བའི་བྲམ་ཟེ་བརྒྱ་སྟོང་མང་པོས་བསྐོར་ཅིང་མདུན་དུ་བྱས་ཏེ།
en: The lords of the world were paying homage to him, and he was encircled and preceded by many hundreds of thousands of brahmins as his family and friends.

source: ཁང་པ་བརྩེགས་པ་རྣམ་པར་སྣང་མཛད་ཀྱི་རྒྱན་གྱིས་བརྒྱན་པའི་སྙིང་པོ་ལོགས་སུ་འོང་བ་མཐོང་ནས་དགའ་རངས་ཏེ། མགུ་ཞིང་ཉམས་བདེ་ལ་ཚིམ་ཞིང་ཡིད་བདེ་བ་སྐྱེས་ནས། བྱང་ཆུབ་སེམས་དཔའ་བྱམས་པ་གང་ན་བ་དེར་ལོགས་སུ་མངོན་དུ་བལྟས་ཏེ། ཐག་རིང་པོ་ནས་བྱང་ཆུབ་སེམས་དཔའ་བྱམས་པ་ལ་ལུས་ཐམས་ཅད་ཀྱིས་ཕབ་སྟེ་ཕྱག་བྱས་སོ། །
en: Seeing him coming to the great kūṭāgāra Vairocana­vyūhālaṃkāra­garbha, Sudhana, overjoyed, pleased, happy, and content, looking in the direction of the bodhisattva Maitreya, bowed down, prostrating with his entire body to the bodhisattva Maitreya in the distance.

source: དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་བྱམས་པས་ཚོང་དཔོན་གྱི་བུ་ནོར་བཟངས་ལ་བལྟས་ཏེ། འཁོར་ཀུན་ལ་ལག་པ་གཡས་པས་བསྟན་ནས་ཡང་དག་པའི་ཡོན་ཏན་གྱིས་བསྔགས་ཏེ་ཚིགས་སུ་བཅད་པ་འདི་དག་སྨྲས་སོ། །ལྟོས་ཤིག་བསམ་པ་ཡོངས་སུ་དག་པ་འདི། །ནོར་བཟངས་ནོར་རྣམས་རབ་ཏུ་བརྟན་པའི་བུ། །
en: Then the bodhisattva Maitreya looked upon Sudhana, the head merchant’s son, and with his right hand indicated him to his retinue and recited these verses: “Look upon this one who has a pure motivation, Sudhana, the child of enduring great wealth.

source: བྱང་ཆུབ་སྤྱོད་པ་དམ་པ་ཡོངས་ཚོལ་ཞིང་། །མཁས་པ་ངའི་དྲུང་དུ་ཉེ་བར་འོངས། །
en: Seeking the sublime bodhisattva conduct, This wise one has come before me.

source: ལེགས་པར་འོངས་སམ་སྙིང་རྗེ་བྱམས་བྱུང་ཁྱོད། །
en: {56} “You, who have come from love and compassion, are welcome!

source: བྱམས་པའི་དཀྱིལ་འཁོར་ཡངས་པ་ལེགས་འོངས་སམ། །
en: You, who have a vast field of love, are welcome!

source: ལེགས་པར་འོངས་སམ་བལྟ་ན་རབ་ཞི་བ། །
en: You, who have a peaceful, serene gaze, are welcome!

source: སྤྱད་པ་སྤྱོད་ཚེ་དུབ་པར་མ་གྱུར་ཏམ། །
en: You have not wearied in your practice of conduct.

source: རྣམ་དག་བསམ་ལྡན་ཚུར་ཤོག་འོངས་པ་ལེགས། །
en: {57} “Come here, you who have a pure motivation—you are welcome!

source: སྐྱོ་མེད་ཡིད་ལྡན་ཚུར་ཤོག་འོངས་པ་ལེགས། །
en: Come here, you who have an undaunted mind—you are welcome!

source: དབང་པོ་མ་ཞུམ་ཚུར་ཤོག་འོངས་པ་ལེགས། །
en: Come here, you who have faultless faculties—you are welcome!

source: མཁས་པ་སྤྱོད་ཚེ་དུབ་པ་མེད་གྲང་ངོ་། །
en: You, wise one, who do not appear wearied in conduct!

source: ཆོས་རྣམས་ཐམས་ཅད་རྣམ་ཕྱེའི་དོན་བྱུང་བ། །
en: {58} “You have come forth to analyze all phenomena.

source: འགྲོ་བ་ཐམས་ཅད་རྣམ་གདུལ་རབ་བརྩོན་པ། །
en: You have been dedicated to guiding all beings.

source: བཤེས་གཉེན་ཐམས་ཅད་བསྙེན་བཀུར་རབ་ཞུགས་པ། །
en: You have become established in honoring all kalyāṇamitras.

source: བརྟུལ་ཞུགས་མི་གཡོ་བརྟན་པ་ཁྱོད་འོངས་ལེགས། །
en: You, who have enduring, unshakable disciplined conduct, are welcome!

source: དགེ་བའི་ལམ་གྱིས་འོངས་པ་བདེར་འོངས་སམ། །
en: {59} “You are welcome, you who have come through the path of goodness!

source: ཡོན་ཏན་ལམ་ལ་གནས་པ་བདེར་འོངས་སམ། །
en: You are welcome, you who are established on the path of good qualities!

source: རྒྱལ་བའི་ལམ་ལ་ཞུགས་པ་བདེར་འོངས་སམ། །
en: You are welcome, you who follow the path of the jinas!

source: ལམ་རྣམས་གང་དུའང་ངལ་བར་མ་གྱུར་ཏམ། །
en: You, who are not wearied by any path!

source: ཡོན་ཏན་རང་བཞིན་ཚུར་ཤོག་བདེར་འོངས་སམ། །
en: {60} “Come here, you who have the nature of good qualities—you are welcome!

source: དགེ་བས་མངོན་བརླན་ཚུར་ཤོག་བདེར་འོངས་སམ། །
en: Come here, you who are saturated by goodness—you are welcome!

source: མཐའ་ཡས་སྤྱོད་ཡུལ་ལེགས་པར་བདེར་འོངས་སམ། །
en: You who have an infinite field of activity, you are perfectly welcome!

source: འགྲོ་བ་ཀུན་ན་ཁྱོད་མཐོང་ཤིན་ཏུ་དཀོན། །
en: It is rare to see one such as you among all beings.

source: ཐོབ་དང་མ་ཐོབ་མཉམ་པའི་ཡིད་ལྡན་པ། །
en: {61} “You have a mind that sees gain and loss as equal.

source: སྨད་དང་སྡུག་བསྔལ་མ་གྲགས་རྣམ་པར་སྤངས། །
en: You have become free of inferiority, suffering, and infamy.

source: འཇིག་རྟེན་ཆོས་ལ་ཨུཏ་པལ་པད་མོ་བཞིན། །
en: Like a blue lotus you are unstained by worldly concerns.

source: ཡིད་ལ་འཁྲུལ་མེད་ལེགས་པར་བདེར་འོངས་སམ། །
en: You, whose mind is free of confusion, are welcome!

source: གཡོ་དང་སྒྱུ་བྲལ་བསམ་པ་དགེ་ལྡན་པ། །
en: {62} “You have a virtuous motivation free of deception and deceit.

source: ང་རྒྱལ་དྲེགས་མེད་སྣོད་ཀྱི་དམ་པ་པོ། །
en: You are an excellent vessel without pride or conceit.

source: ཁྲོ་དང་འཚིག་མེད་ཁེངས་ཤིང་འགྱིང་བ་མེད། །བལྟ་ན་སྡུག་པ་ཁྱོད་མཐོང་ལེགས་པ་ཡིན། །
en: You who have no anger or fury, no haughtiness or arrogance, It is excellent to see you who are a delightful sight.

source: ཚུར་ཤོག་ཕྱོགས་ཀུན་སྤྱོད་ཡུལ་མངོན་གྱུར་པ། །
en: {63} “Come here, you who enter a field of conduct in all directions.

source: ཚུར་ཤོག་རྒྱལ་བའི་མཛོད་རྣམས་སྒྲུབ་བྱེད་པ། །
en: Come here, you who accomplish the treasures of the jinas.

source: ཚུར་ཤོག་རྒྱལ་བའི་མཛོད་རྣམས་འཕེལ་བྱེད་པ། །
en: Come here, you who increase the treasures of the jinas.

source: ཡིད་ལ་དུབ་མེད་ལེགས་པར་ཁྱོད་འོངས་སམ། །
en: You, whose mind is never disheartened, are perfectly welcome!

source: ཚུར་ཤོག་དུས་གསུམ་ཡུལ་ལྡན་འོངས་པ་ལེགས། །ཆོས་ཀྱི་དབྱིངས་ལ་མོས་པའི་དཀྱིལ་འཁོར་ལྡན། །
en: {64} “Come here, you who have the three times as your range of perception—you are welcome!

source: སངས་རྒྱས་ཀུན་གྱི་ཡོན་ཏན་སྙིང་པོར་བྱུང་། །མཁས་པ་ལེགས་པར་འོངས་སམ་མིང་ལ་ལམ། །
en: You who have a field of aspiration for the realm of the Dharma, You who arise from the essence of the qualities of all buddhas, Wise one, you who are unwearied, you are welcome!

source: ཚུར་ཤོག་འཇམ་དཔལ་ཡེ་ཤེས་པད་མོའི་མཆོག །
en: {65} “Come here, you who are the supreme lotus of the wisdom of Mañjuśrī.

source: ཚུར་ཤོག་སྤྲིན་དཔལ་ཆར་པས་རྣམ་སྤེལ་བ། །
en: Come here, you who cause increase through the rain from glorious clouds.

source: རྒྱལ་བ་ཀུན་གྱི་སྲས་ཀྱིས་བཏང་བ་ཚུར། །ཁྱོད་ལ་བསྒྲིབས་པ་མེད་པའི་ཕྱོགས་ཀྱང་བསྟན། །
en: Come here, you who have been sent by all the jinaputras, And I will reveal to you the direction without obscuration.

source: ལྟོས་ཤིག་སྨོན་ལམ་དྲ་བ་ཅི་འདྲ་བ། །ཆོས་དབྱིངས་རྒྱས་འགེངས་བསམ་གྱིས་མི་ཁྱབ་སྟེ། །བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་ལ་ལམ་བསྒྲུབས་པ། །རྒྱ་ཆེ་ཡངས་བྱེད་ནོར་བཟངས་འདིར་འོངས་སོ། །
en: {66} “Observe this one who is like a net of prayers That inconceivably pervades the realm of phenomena, Who has accomplished the path of bodhisattva conduct, The one whose acts are vast, Sudhana, who has come here!

source: བདེ་བར་གཤེགས་པའི་སྤྱོད་ཡུལ་ཚོལ་བྱེད་ཅིང་། །རྡུལ་དང་བྲལ་བའི་སྤྱོད་པ་འགྲོ་བའི་ཕྱིར། །སྨོན་ལམ་རླབས་ཆེན་ཡོངས་སུ་འདྲི་བྱེད་ཅིང་། །སྐྱོ་བའི་ཡིད་མེད་འདི་ནི་འདིར་འོངས་སོ། །
en: {67} “He who seeks the field of activity of the sugatas, Who in order to practice a conduct that is free of stains Makes inquiries about a vast range of prayers And has an unwearied mind, has come here!

source: འདས་པའི་མགོན་པོས་གང་ལ་བསླབས་མཛད་དེ། །དེ་བཞིན་མ་བྱོན་རྣམས་ཀྱང་སློབ་འགྱུར་ལ། །
en: {68} “Just as he has been instructed by the guides of the past, In that way he will learn from those in the future.

source: བདེ་གཤེགས་བཞུགས་པའི་སྤྱོད་པར་བྱ་བ་རྣམས། །ཡོངས་སུ་དྲིས་ཕྱིར་འདི་ནི་འདིར་འོངས་སོ། །
en: He has come here to ask questions concerning The conduct of the sugatas in the present.
